In [2]:
import pandas as pd

In [7]:
#create a simple dataset of people
data ={'Name':["Gopi","Sree","Aarthy"],'Location':["Villupuram","chennai","Vellore"],'Age':[39, 8, 34]}
data_pandas = pd.DataFrame(data)
print(data_pandas)

     Name    Location  Age
0    Gopi  Villupuram   39
1    Sree     chennai    8
2  Aarthy     Vellore   34

In [8]:
display(data_pandas[data_pandas.Age>30])

     Name    Location  Age
0    Gopi  Villupuram   39
2  Aarthy     Vellore   34